Revit 2027 API
UIDocument.Application Property
 Retrieves an object that represents the current Application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UIApplication Application { get; }
Public ReadOnly Property Application As UIApplication
	Get
public:
property UIApplication^ Application {
	UIApplication^ get ();
}
member Application : UIApplication with get
Property Value
UIApplication
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace